In [ ]:
#1) (12 points) What are different collection datatypes in Python? How do they differ
#from one another?

#Answer:
#the 4 built in collection datatypes are sets, lists,tuples, and dictionaries
#Sets are unordered and unindexed

In [ ]:
#2) (20 points) Create a DataFrame using a dictionary that looks like below. Name the
#DataFrame as emp_df.

In [1]:
#import the pandas library so we can create a dataframe from the dictionary
import pandas as pd

In [2]:
#create the dictionary as given in the problem
data_dict={"name":["Nancy","Andrew","Janet","Margaret","Steven"],"monthly_salary":[5000,4000,6000,3000,2000],"zip":[98122,98401,98033,98052,98051]}
#define the data frame emp_df using the DataFrame function from the pandas library
emp_df=pd.DataFrame(data_dict)

In [3]:
#print the data frame to check work
emp_df

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [6]:
#print the first row
emp_df.iloc[[0]]

    name  monthly_salary    zip
0  Nancy            5000  98122

In [7]:
#print the last row
emp_df.iloc[[-1]]

     name  monthly_salary    zip
4  Steven            2000  98051

In [8]:
#print the shape of the df.  In this case it shows us 5 rows and 3 columns
emp_df.shape

(5, 3)

In [9]:
#print the size of the df. This shows us there are 15 values
emp_df.size

15

In [11]:
#calculate the average salary for all the employees
emp_df.monthly_salary.mean()

4000.0

In [12]:
#sort by name ascending order
emp_df.sort_values(by=['name'],ascending=True)

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

In [20]:
#print the row with for the employee with zipcode 98033
emp_df[emp_df['zip']==98033]

    name  monthly_salary    zip
2  Janet            6000  98033

In [21]:
#create a new column annual salary and define it to be 12 the existing 
#monthly_salary column
emp_df['annual salary']=(emp_df['monthly_salary']*12)
emp_df

       name  monthly_salary    zip  annual salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [35]:
#rename the column name to firstname
emp_df=emp_df.rename(columns={'name':'firstname'})

In [51]:
#create a new df emp_info with only firstname, annual salary, and zip
emp_info=emp_df[['firstname','annual salary','zip']]
emp_info

  firstname  annual salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Steven          24000  98051

In [61]:
#print only column firstname from emp_info
emp_info['firstname']

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [62]:
#drop the column annual salary from the emp_info data frame
emp_info=emp_info.drop('annual salary',axis=1)
emp_info

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051